dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/libraries/Thread/src/ot_radio_nrf52840.cpp
// ot_radio_nrf52840.cpp - OpenThread radio platform (otPlatRadio*) on the
// nRF52840's own RADIO peripheral in IEEE 802.15.4 (250 kbit) mode.
//
// The register recipe (MODE/PCNF/CRC/SFD/FREQUENCY) is the configuration that
// was hardware-verified bidirectionally against a CC2530 sniffer/transceiver
// on 2026-06-07. On top of it this driver adds what OpenThread needs:
//
//   * IRQ-driven RX into a small ring of frame slots, with software address
//     filtering (the nRF 802.15.4 mode has no hardware address filter).
//   * Immediate-ack TX for received unicast frames with the AR bit, with the
//     frame-pending bit driven by the OT source-match table.
//   * TX with a single hardware CCA attempt per otPlatRadioTransmit() call -
//     the radio advertises OT_RADIO_CAPS_NONE so the OT sub-MAC does CSMA
//     backoff, retransmits, ack timeout and TX security in software.
//   * ISR -> thread handoff: the ISR only moves bytes and flips slot states;
//     otPlatRadioReceiveDone()/otPlatRadioTxDone() run from nrfOtRadioProcess()
//     in the main loop (the OT core is not ISR-safe).
//
// Ack-timeout contract (matches the simulation platform): the driver reports
// TxDone only for "ack received", "tx done, no ack wanted" and "CCA busy".
// It NEVER reports NO_ACK - the sub-MAC's software ack timer owns that. A
// stale ack-wait is cancelled by the next Transmit()/Receive() call.

#include <stdint.h>
#include <stddef.h>
#include <string.h>

#include "openthread-core-config.h"

extern "C" {
#include <openthread/platform/radio.h>
#include <openthread/platform/time.h>
}

#include "../../../cores/arduino/NrfPeripherals.h"   // NrfTimer (TIMER3 = us clock)
#include "ot_platform_arduino.h"

// ---------------------------------------------------------------------------
// Register access (offsets verified against the vendored nRF52840 MDK header)
// ---------------------------------------------------------------------------

#define RADIO_REG(o) (*(volatile uint32_t *)(0x40001000UL + (o)))
#define CLOCK_REG(o) (*(volatile uint32_t *)(0x40000000UL + (o)))

// RADIO tasks
#define R_TASKS_TXEN       0x000
#define R_TASKS_RXEN       0x004
#define R_TASKS_START      0x008
#define R_TASKS_STOP       0x00C
#define R_TASKS_DISABLE    0x010
#define R_TASKS_RSSISTART  0x014
#define R_TASKS_CCASTART   0x02C
#define R_TASKS_CCASTOP    0x030
// RADIO events
#define R_EVENTS_READY     0x100
#define R_EVENTS_END       0x10C
#define R_EVENTS_DISABLED  0x110
#define R_EVENTS_RSSIEND   0x11C
#define R_EVENTS_CRCOK     0x130
#define R_EVENTS_CRCERROR  0x134
#define R_EVENTS_CCAIDLE   0x144
#define R_EVENTS_CCABUSY   0x148
#define R_EVENTS_TXREADY   0x154
#define R_EVENTS_RXREADY   0x158
// RADIO registers
#define R_SHORTS           0x200
#define R_INTENSET         0x304
#define R_INTENCLR         0x308
#define R_CRCSTATUS        0x400
#define R_PACKETPTR        0x504
#define R_FREQUENCY        0x508
#define R_TXPOWER          0x50C
#define R_MODE             0x510
#define R_PCNF0            0x514
#define R_PCNF1            0x518
#define R_CRCCNF           0x534
#define R_CRCPOLY          0x538
#define R_CRCINIT          0x53C
#define R_RSSISAMPLE       0x548
#define R_STATE            0x550
#define R_SFD              0x660
#define R_CCACTRL          0x66C

// SHORTS bits
#define SH_DISABLED_TXEN   (1UL << 2)
#define SH_DISABLED_RXEN   (1UL << 3)
#define SH_ADDRESS_RSSISTART (1UL << 4)
#define SH_TXREADY_START   (1UL << 18)
#define SH_RXREADY_START   (1UL << 19)

// INTEN bits
#define INT_END            (1UL << 3)
#define INT_CRCERROR       (1UL << 13)
#define INT_CCAIDLE        (1UL << 17)
#define INT_CCABUSY        (1UL << 18)

// NVIC, RADIO = IRQ 1
#define NVIC_ISER          (*(volatile uint32_t *)0xE000E100UL)
#define NVIC_ICER          (*(volatile uint32_t *)0xE000E180UL)
#define NVIC_IPR1_B1       (*(volatile uint8_t *)(0xE000E400UL + 1U))
#define RADIO_IRQ_BIT      (1UL << 1)

// CLOCK
#define C_TASKS_HFCLKSTART 0x000
#define C_EVENTS_HFCLKSTARTED 0x100

// ---------------------------------------------------------------------------
// MAC frame constants
// ---------------------------------------------------------------------------

#define FCF_TYPE_MASK     0x0007
#define FCF_TYPE_DATA     0x0001
#define FCF_TYPE_ACK      0x0002
#define FCF_TYPE_CMD      0x0003
#define FCF_FRAME_PENDING 0x0010
#define FCF_ACK_REQUEST   0x0020
#define FCF_PANID_COMP    0x0040
#define FCF_DST_MASK      0x0C00
#define FCF_DST_NONE      0x0000
#define FCF_DST_SHORT     0x0800
#define FCF_DST_EXT       0x0C00
#define FCF_SRC_MASK      0xC000
#define FCF_SRC_NONE      0x0000
#define FCF_SRC_SHORT     0x8000
#define FCF_SRC_EXT       0xC000

#define MAC_BCAST_ADDR    0xFFFF
#define MAC_BCAST_PANID   0xFFFF

#define PHR_SIZE          1
#define FCS_SIZE          2
#define MAX_PSDU          127

// ---------------------------------------------------------------------------
// Driver state
// ---------------------------------------------------------------------------

enum RadioState : uint8_t
{
    kStateDisabled = 0,
    kStateSleep,
    kStateRx,         // receiving (also the resting state)
    kStateCca,        // CCA running, TX armed on idle
    kStateTx,         // transmitting the outgoing frame
    kStateAckTx,      // transmitting an immediate ack for a received frame
};

enum SlotState : uint8_t
{
    kSlotFree = 0,
    kSlotRadio,       // owned by the RADIO DMA right now
    kSlotReady,       // CRC-ok frame waiting for nrfOtRadioProcess()
};

struct RxSlot
{
    uint8_t  buf[PHR_SIZE + MAX_PSDU + 1]; // PHR + PSDU (FCS bytes not stored)
    volatile SlotState state;
    int8_t   rssi;
    uint8_t  lqi;
    uint64_t timestamp;
    bool     ackedWithFp;
};

enum TxEvent : uint8_t
{
    kTxEventNone = 0,
    kTxEventDone,       // sent, no ack requested
    kTxEventAcked,      // sent, matching imm-ack captured in sAckRxBuf
    kTxEventCcaBusy,    // CCA reported busy
};

#define RX_SLOT_COUNT 4

static RxSlot   sRxSlots[RX_SLOT_COUNT];
static volatile uint8_t sCurrentSlot;        // slot the RADIO DMA writes into

