dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/libraries/Thread/src/ot_radio_nrf52840.cpp
static RadioState volatile sState = kStateDisabled;
static bool     sEnabled;
static bool     sPromiscuous;
static uint8_t  sChannel = 11;
static int8_t   sTxPower;
static int8_t   sCcaThresholdDbm = -75;

static uint16_t sPanId  = MAC_BCAST_PANID;
static uint16_t sShortAddr = MAC_BCAST_ADDR;
static uint8_t  sExtAddr[8];                 // little-endian, as on air

// TX
static uint8_t  sTxBuf[PHR_SIZE + MAX_PSDU]; // PHR + PSDU (FCS appended by HW)
static otRadioFrame sTxFrame;                // handed to the OT core
static uint8_t  sTxPsdu[MAX_PSDU];
static volatile bool sAckWait;               // TX done, waiting for imm-ack
static volatile uint8_t sAckWaitSeq;
static volatile TxEvent sTxEvent = kTxEventNone;
static uint8_t  sAckRxBuf[PHR_SIZE + MAX_PSDU + 1]; // captured ack for TxDone
static otRadioFrame sAckRxFrame;
static volatile bool sTxPending;             // Transmit() accepted, TxDone owed

// immediate ack we transmit: PHR + FCF(2) + seq
static uint8_t  sAckTxBuf[PHR_SIZE + 3];

// source match (drives the frame-pending bit in our acks)
#define SRC_MATCH_SHORT_COUNT 16
#define SRC_MATCH_EXT_COUNT   8
static bool     sSrcMatchEnabled;
static uint16_t sSrcMatchShort[SRC_MATCH_SHORT_COUNT];
static uint8_t  sSrcMatchShortCount;
static uint8_t  sSrcMatchExt[SRC_MATCH_EXT_COUNT][8];
static uint8_t  sSrcMatchExtCount;

// IEEE 802.15.4 energy-detect threshold register granularity: EDSAMPLE/CCA ED
// values are roughly dBm + 94 (0 == -94 dBm, the radio's measurement floor).
#define ED_FLOOR_DBM (-94)

static inline uint32_t criticalEnter(void)
{
    uint32_t primask;
    __asm volatile("mrs %0, primask" : "=r"(primask));
    __asm volatile("cpsid i" ::: "memory");
    return primask;
}

static inline void criticalExit(uint32_t primask)
{
    if ((primask & 1U) == 0U)
    {
        __asm volatile("cpsie i" ::: "memory");
    }
}

static inline uint64_t radioTimeUs(void) { return (uint64_t)nrfTimer3().counter(); }

// ---------------------------------------------------------------------------
// Low-level helpers (callable from ISR and, inside critical sections, thread)
// ---------------------------------------------------------------------------

static void radioApplyChannel(void)
{
    RADIO_REG(R_FREQUENCY) = (uint32_t)(5U * (sChannel - 10U));
}

static void radioApplyTxPower(void)
{
    RADIO_REG(R_TXPOWER) = (uint32_t)(uint8_t)sTxPower;
}

static uint8_t findFreeSlot(void)
{
    for (uint8_t i = 0; i < RX_SLOT_COUNT; i++)
    {
        if (sRxSlots[i].state == kSlotFree)
        {
            return i;
        }
    }
    return sCurrentSlot; // ring exhausted: overwrite the in-flight slot
}

// Disable -> RXEN -> START chain; leaves the radio receiving into a slot.
static void radioEnterRx(void)
{
    uint8_t slot = findFreeSlot();

    sCurrentSlot = slot;
    sRxSlots[slot].state = kSlotRadio;

    RADIO_REG(R_PACKETPTR) = (uint32_t)sRxSlots[slot].buf;
    RADIO_REG(R_EVENTS_END) = 0;
    RADIO_REG(R_EVENTS_CRCOK) = 0;
    RADIO_REG(R_EVENTS_CRCERROR) = 0;
    RADIO_REG(R_EVENTS_DISABLED) = 0;
    RADIO_REG(R_EVENTS_RXREADY) = 0;
    RADIO_REG(R_SHORTS) = SH_DISABLED_RXEN | SH_RXREADY_START | SH_ADDRESS_RSSISTART;
    RADIO_REG(R_TASKS_DISABLE) = 1;
    sState = kStateRx;
}

static void radioEnterSleep(void)
{
    RADIO_REG(R_SHORTS) = 0;
    RADIO_REG(R_TASKS_CCASTOP) = 1;
    RADIO_REG(R_TASKS_DISABLE) = 1;
    if (sCurrentSlot < RX_SLOT_COUNT && sRxSlots[sCurrentSlot].state == kSlotRadio)
    {
        sRxSlots[sCurrentSlot].state = kSlotFree;
    }
    sState = kStateSleep;
}

// Parse enough of the MHR to (a) know whether the frame is for us and
// (b) find the source address for the frame-pending decision. Returns false
// for frames the filter should drop (when not promiscuous).
struct FrameInfo
{
    uint16_t fcf;
    uint8_t  seq;
    bool     dstIsUs;     // unicast match on short or extended address
    bool     dstIsBcast;
    uint8_t  srcMode;     // FCF_SRC_* value
    uint16_t srcShort;
    const uint8_t *srcExt;
};

static bool parseFrame(const uint8_t *psdu, uint8_t length, FrameInfo &info)
{
    if (length < 3)
    {
        return false;
    }

    info.fcf  = (uint16_t)(psdu[0] | ((uint16_t)psdu[1] << 8));
    info.seq  = psdu[2];
    info.dstIsUs = false;
    info.dstIsBcast = false;
    info.srcMode = 0;
    info.srcShort = 0;
    info.srcExt = NULL;

    uint8_t  pos = 3;
    uint16_t dstMode = info.fcf & FCF_DST_MASK;
    uint16_t srcMode = info.fcf & FCF_SRC_MASK;

    if (dstMode != FCF_DST_NONE)
    {
        if (pos + 2 > length)
        {
            return false;
        }
        uint16_t dstPan = (uint16_t)(psdu[pos] | ((uint16_t)psdu[pos + 1] << 8));
        pos += 2;

        bool panOk = (dstPan == sPanId) || (dstPan == MAC_BCAST_PANID);

        if (dstMode == FCF_DST_SHORT)
        {
            if (pos + 2 > length)
            {
                return false;
            }
            uint16_t dst = (uint16_t)(psdu[pos] | ((uint16_t)psdu[pos + 1] << 8));
            pos += 2;
            info.dstIsBcast = (dst == MAC_BCAST_ADDR) && panOk;
            info.dstIsUs    = (dst == sShortAddr) && panOk;
        }
        else if (dstMode == FCF_DST_EXT)
        {
            if (pos + 8 > length)
            {
                return false;
            }
            info.dstIsUs = panOk && (memcmp(&psdu[pos], sExtAddr, 8) == 0);
            pos += 8;
        }
        else
        {
            return false; // reserved dst mode
        }
    }

    if (srcMode != FCF_SRC_NONE)
    {
        if ((info.fcf & FCF_PANID_COMP) == 0)
        {
            if (pos + 2 > length)
            {
                return false;
            }
            pos += 2; // src PAN id - not used by the filter
        }
        if (srcMode == FCF_SRC_SHORT)
        {
            if (pos + 2 > length)
            {
                return false;
            }
            info.srcShort = (uint16_t)(psdu[pos] | ((uint16_t)psdu[pos + 1] << 8));
        }
        else if (srcMode == FCF_SRC_EXT)
        {
            if (pos + 8 > length)
            {
                return false;
            }
            info.srcExt = &psdu[pos];
        }
        else
        {
            return false;
        }
        info.srcMode = (uint8_t)(srcMode >> 14);
    }

