dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/libraries/Thread/src/ot_radio_nrf52840.cpp
    return true;
}

// Frame-pending decision for the ack we are about to send. With source
// matching disabled OT expects "pending" for everyone (conservative default
// while the parent has queued indirect frames).
static bool srcMatchHasPending(const FrameInfo &info)
{
    bool pending = true;

    if (!sSrcMatchEnabled)
    {
        return true;
    }

    pending = false;

    if (info.srcMode == (uint8_t)(FCF_SRC_SHORT >> 14))
    {
        for (uint8_t i = 0; i < sSrcMatchShortCount; i++)
        {
            if (sSrcMatchShort[i] == info.srcShort)
            {
                pending = true;
                break;
            }
        }
    }
    else if (info.srcExt != NULL)
    {
        for (uint8_t i = 0; i < sSrcMatchExtCount; i++)
        {
            if (memcmp(sSrcMatchExt[i], info.srcExt, 8) == 0)
            {
                pending = true;
                break;
            }
        }
    }

    return pending;
}

static int8_t lastRssiDbm(void)
{
    return (int8_t)(-(int32_t)(RADIO_REG(R_RSSISAMPLE) & 0x7FU));
}

static uint8_t rssiToLqi(int8_t rssi)
{
    // Linear map of the useful RSSI window (-100..-40 dBm) onto 0..255.
    int32_t lqi = ((int32_t)rssi + 100) * 255 / 60;
    if (lqi < 0)
    {
        lqi = 0;
    }
    if (lqi > 255)
    {
        lqi = 255;
    }
    return (uint8_t)lqi;
}

// ---------------------------------------------------------------------------
// RADIO interrupt
// ---------------------------------------------------------------------------

extern "C" void RADIO_IRQHandler(void)
{
    // CCA outcome (TX armed via SHORTS on idle; busy needs cleanup here).
    if (RADIO_REG(R_EVENTS_CCABUSY) != 0)
    {
        RADIO_REG(R_EVENTS_CCABUSY) = 0;
        RADIO_REG(R_EVENTS_CCAIDLE) = 0;
        if (sState == kStateCca)
        {
            sTxEvent = kTxEventCcaBusy;
            radioEnterRx();
        }
    }

    if (RADIO_REG(R_EVENTS_CCAIDLE) != 0)
    {
        RADIO_REG(R_EVENTS_CCAIDLE) = 0;
        if (sState == kStateCca)
        {
            // Channel clear: hop RX -> DISABLED -> TX, START on ready.
            RADIO_REG(R_PACKETPTR) = (uint32_t)sTxBuf;
            RADIO_REG(R_EVENTS_END) = 0;
            RADIO_REG(R_EVENTS_DISABLED) = 0;
            RADIO_REG(R_SHORTS) = SH_DISABLED_TXEN | SH_TXREADY_START;
            RADIO_REG(R_TASKS_DISABLE) = 1;
            sState = kStateTx;
        }
    }

    if (RADIO_REG(R_EVENTS_CRCERROR) != 0)
    {
        RADIO_REG(R_EVENTS_CRCERROR) = 0;
        RADIO_REG(R_EVENTS_END) = 0; // END fired together with CRCERROR
        if (sState == kStateRx)
        {
            RADIO_REG(R_TASKS_START) = 1; // same slot, just listen again
        }
    }

    if (RADIO_REG(R_EVENTS_END) != 0)
    {
        RADIO_REG(R_EVENTS_END) = 0;

        switch (sState)
        {
        case kStateTx:
        {
            // Outgoing frame is on the air.
            bool wantAck = (sTxFrame.mPsdu[0] & (FCF_ACK_REQUEST & 0xFF)) != 0;

            if (wantAck)
            {
                sAckWait    = true;
                sAckWaitSeq = sTxFrame.mPsdu[2];
                radioEnterRx(); // listen for the imm-ack
            }
            else
            {
                sTxEvent = kTxEventDone;
                radioEnterRx();
            }
            break;
        }

        case kStateAckTx:
            // Our immediate ack went out; resume listening.
            radioEnterRx();
            break;

        case kStateRx:
        {
            RxSlot &slot = sRxSlots[sCurrentSlot];

            if (RADIO_REG(R_EVENTS_CRCOK) == 0)
            {
                // END without CRCOK (CRCERROR path already restarted RX).
                break;
            }
            RADIO_REG(R_EVENTS_CRCOK) = 0;

            uint8_t phr = slot.buf[0];

            if (phr < 3 + FCS_SIZE || phr > MAX_PSDU)
            {
                RADIO_REG(R_TASKS_START) = 1;
                break;
            }

            uint8_t   macLen = (uint8_t)(phr - FCS_SIZE); // PSDU minus FCS
            FrameInfo info;
            bool      parsed = parseFrame(&slot.buf[1], macLen, info);
            int8_t    rssi   = lastRssiDbm();

            // Imm-ack we are waiting for after a TX?
            if (parsed && (info.fcf & FCF_TYPE_MASK) == FCF_TYPE_ACK)
            {
                if (sAckWait && info.seq == sAckWaitSeq && sTxEvent == kTxEventNone)
                {
                    sAckWait = false;
                    memcpy(sAckRxBuf, slot.buf, (size_t)phr + 1U - FCS_SIZE);
                    sAckRxBuf[0] = phr;
                    sAckRxFrame.mLength = phr;
                    sAckRxFrame.mChannel = sChannel;
                    sAckRxFrame.mInfo.mRxInfo.mRssi = rssi;
                    sAckRxFrame.mInfo.mRxInfo.mLqi  = rssiToLqi(rssi);
                    sAckRxFrame.mInfo.mRxInfo.mTimestamp = radioTimeUs();
                    sTxEvent = kTxEventAcked;
                }
                RADIO_REG(R_TASKS_START) = 1; // acks are never queued upward
                break;
            }

            bool accept = sPromiscuous ||
                          (parsed && (info.dstIsUs || info.dstIsBcast ||
                                      (info.fcf & FCF_DST_MASK) == FCF_DST_NONE));

            if (!accept)
            {
                RADIO_REG(R_TASKS_START) = 1;
                break;
            }

            slot.rssi      = rssi;
            slot.lqi       = rssiToLqi(rssi);
            slot.timestamp = radioTimeUs();

            bool needAck = !sPromiscuous && parsed && info.dstIsUs &&
                           (info.fcf & FCF_ACK_REQUEST) != 0 &&
                           (((info.fcf & FCF_TYPE_MASK) == FCF_TYPE_DATA) ||
                            ((info.fcf & FCF_TYPE_MASK) == FCF_TYPE_CMD));

            if (needAck)
            {
                bool fp = srcMatchHasPending(info);

                slot.ackedWithFp = fp;
                slot.state       = kSlotReady;

                sAckTxBuf[0] = 5; // PHR: FCF(2) + seq + FCS(2)
                sAckTxBuf[1] = (uint8_t)(FCF_TYPE_ACK | (fp ? FCF_FRAME_PENDING : 0));
                sAckTxBuf[2] = 0;
                sAckTxBuf[3] = info.seq;

                RADIO_REG(R_PACKETPTR) = (uint32_t)sAckTxBuf;
                RADIO_REG(R_EVENTS_DISABLED) = 0;
                RADIO_REG(R_SHORTS) = SH_DISABLED_TXEN | SH_TXREADY_START;
                RADIO_REG(R_TASKS_DISABLE) = 1;
                sState = kStateAckTx;
            }
            else
            {
                slot.ackedWithFp = false;
                slot.state       = kSlotReady;
                radioEnterRx(); // next free slot, keep listening
            }
            break;
        }

        default:
            break;
        }
    }
}

// ---------------------------------------------------------------------------
// otPlatRadio* implementation
// ---------------------------------------------------------------------------

