dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/libraries/Thread/src/ot_radio_nrf52840.cpp
extern "C" {

otRadioCaps otPlatRadioGetCaps(otInstance *aInstance)
{
    (void)aInstance;
    return OT_RADIO_CAPS_NONE;
}

int8_t otPlatRadioGetReceiveSensitivity(otInstance *aInstance)
{
    (void)aInstance;
    return -100;
}

void otPlatRadioSetPanId(otInstance *aInstance, otPanId aPanId)
{
    (void)aInstance;
    uint32_t m = criticalEnter();
    sPanId = aPanId;
    criticalExit(m);
}

void otPlatRadioSetExtendedAddress(otInstance *aInstance, const otExtAddress *aExtAddress)
{
    (void)aInstance;
    uint32_t m = criticalEnter();
    memcpy(sExtAddr, aExtAddress->m8, 8); // already little-endian (as on air)
    criticalExit(m);
}

void otPlatRadioSetShortAddress(otInstance *aInstance, otShortAddress aShortAddress)
{
    (void)aInstance;
    uint32_t m = criticalEnter();
    sShortAddr = aShortAddress;
    criticalExit(m);
}

otError otPlatRadioGetTransmitPower(otInstance *aInstance, int8_t *aPower)
{
    (void)aInstance;
    if (aPower == NULL)
    {
        return OT_ERROR_INVALID_ARGS;
    }
    *aPower = sTxPower;
    return OT_ERROR_NONE;
}

otError otPlatRadioSetTransmitPower(otInstance *aInstance, int8_t aPower)
{
    (void)aInstance;
    // Clamp to the nRF52840 PA range.
    if (aPower > 8)
    {
        aPower = 8;
    }
    if (aPower < -40)
    {
        aPower = -40;
    }
    sTxPower = aPower;
    radioApplyTxPower();
    return OT_ERROR_NONE;
}

otError otPlatRadioGetCcaEnergyDetectThreshold(otInstance *aInstance, int8_t *aThreshold)
{
    (void)aInstance;
    if (aThreshold == NULL)
    {
        return OT_ERROR_INVALID_ARGS;
    }
    *aThreshold = sCcaThresholdDbm;
    return OT_ERROR_NONE;
}

otError otPlatRadioSetCcaEnergyDetectThreshold(otInstance *aInstance, int8_t aThreshold)
{
    (void)aInstance;
    int32_t ed = (int32_t)aThreshold - ED_FLOOR_DBM;
    if (ed < 0)
    {
        ed = 0;
    }
    if (ed > 255)
    {
        ed = 255;
    }
    sCcaThresholdDbm = aThreshold;
    // CCA mode = ED (0), EDTHRES in bits 8..15; keep correlator defaults.
    RADIO_REG(R_CCACTRL) = (RADIO_REG(R_CCACTRL) & ~0x0000FF07UL) | ((uint32_t)ed << 8);
    return OT_ERROR_NONE;
}

bool otPlatRadioGetPromiscuous(otInstance *aInstance)
{
    (void)aInstance;
    return sPromiscuous;
}

void otPlatRadioSetPromiscuous(otInstance *aInstance, bool aEnable)
{
    (void)aInstance;
    sPromiscuous = aEnable;
}

otError otPlatRadioEnable(otInstance *aInstance)
{
    (void)aInstance;
    if (!sEnabled)
    {
        nrfOtRadioInit();
        sEnabled = true;
        sState   = kStateSleep;
    }
    return OT_ERROR_NONE;
}

otError otPlatRadioDisable(otInstance *aInstance)
{
    (void)aInstance;
    if (sEnabled)
    {
        uint32_t m = criticalEnter();
        radioEnterSleep();
        sState   = kStateDisabled;
        sEnabled = false;
        criticalExit(m);
    }
    return OT_ERROR_NONE;
}

bool otPlatRadioIsEnabled(otInstance *aInstance)
{
    (void)aInstance;
    return sEnabled;
}

otError otPlatRadioSleep(otInstance *aInstance)
{
    (void)aInstance;
    if (!sEnabled)
    {
        return OT_ERROR_INVALID_STATE;
    }

    uint32_t m = criticalEnter();
    sAckWait = false;
    radioEnterSleep();
    criticalExit(m);
    return OT_ERROR_NONE;
}

otError otPlatRadioReceive(otInstance *aInstance, uint8_t aChannel)
{
    (void)aInstance;
    if (!sEnabled)
    {
        return OT_ERROR_INVALID_STATE;
    }

    uint32_t m = criticalEnter();

    sAckWait = false; // a new Receive() abandons any stale ack wait

    if (sChannel != aChannel || sState != kStateRx)
    {
        sChannel = aChannel;
        RADIO_REG(R_SHORTS) = 0;
        RADIO_REG(R_TASKS_CCASTOP) = 1;
        radioApplyChannel();
        radioEnterRx();
    }

    criticalExit(m);
    return OT_ERROR_NONE;
}

otRadioFrame *otPlatRadioGetTransmitBuffer(otInstance *aInstance)
{
    (void)aInstance;
    return &sTxFrame;
}

otError otPlatRadioTransmit(otInstance *aInstance, otRadioFrame *aFrame)
{
    if (!sEnabled || aFrame != &sTxFrame || aFrame->mLength < FCS_SIZE + 3 ||
        aFrame->mLength > MAX_PSDU)
    {
        return OT_ERROR_INVALID_STATE;
    }

    uint32_t m = criticalEnter();

    if (sState != kStateRx && sState != kStateSleep)
    {
        criticalExit(m);
        return OT_ERROR_INVALID_STATE;
    }

    sAckWait  = false;
    sTxEvent  = kTxEventNone;
    sTxPending = true;

    if (sChannel != aFrame->mChannel)
    {
        sChannel = aFrame->mChannel;
        radioApplyChannel();
    }

    sTxBuf[0] = (uint8_t)aFrame->mLength; // PHR includes the FCS bytes
    memcpy(&sTxBuf[1], aFrame->mPsdu, (size_t)aFrame->mLength - FCS_SIZE);

    if (sCurrentSlot < RX_SLOT_COUNT && sRxSlots[sCurrentSlot].state == kSlotRadio)
    {
        sRxSlots[sCurrentSlot].state = kSlotFree;
    }

    if (aFrame->mInfo.mTxInfo.mCsmaCaEnabled)
    {
        // Single CCA attempt; the sub-MAC owns the backoff loop. CCA needs
        // an active receiver, so make sure RX is up before CCASTART.
        RADIO_REG(R_EVENTS_CCAIDLE) = 0;
        RADIO_REG(R_EVENTS_CCABUSY) = 0;

        if (sState == kStateRx && (RADIO_REG(R_STATE) & 0x0FU) != 0U)
        {
            sState = kStateCca;
            RADIO_REG(R_SHORTS) = 0;
            RADIO_REG(R_TASKS_CCASTART) = 1;
        }
        else
        {
            // From sleep: ramp RX and chain straight into CCA.
            sState = kStateCca;
            RADIO_REG(R_SHORTS) = SH_DISABLED_RXEN | SH_RXREADY_START;
            RADIO_REG(R_EVENTS_RXREADY) = 0;
            RADIO_REG(R_TASKS_DISABLE) = 1;
            // Wait for ramp-up in the ISR? RXREADY has no interrupt enabled;
            // instead start CCA from the thread after ramp (~130 us spin).
            criticalExit(m);
            {
                uint32_t spin = 0;
                while (RADIO_REG(R_EVENTS_RXREADY) == 0 && spin++ < 50000U)
                {
                }
            }
            m = criticalEnter();
            RADIO_REG(R_SHORTS) = 0;
            RADIO_REG(R_TASKS_CCASTART) = 1;
        }
    }
    else
    {
        sState = kStateTx;
        RADIO_REG(R_PACKETPTR) = (uint32_t)sTxBuf;
        RADIO_REG(R_EVENTS_END) = 0;
        RADIO_REG(R_EVENTS_DISABLED) = 0;
        RADIO_REG(R_SHORTS) = SH_DISABLED_TXEN | SH_TXREADY_START;
        RADIO_REG(R_TASKS_DISABLE) = 1;
    }

    aFrame->mInfo.mTxInfo.mTimestamp = radioTimeUs();

    criticalExit(m);

    otPlatRadioTxStarted(aInstance, aFrame);

    return OT_ERROR_NONE;
}

int8_t otPlatRadioGetRssi(otInstance *aInstance)
{
    (void)aInstance;

    if (sState != kStateRx)
    {
        return OT_RADIO_RSSI_INVALID;
    }

    RADIO_REG(R_EVENTS_RSSIEND) = 0;
    RADIO_REG(R_TASKS_RSSISTART) = 1;

    uint32_t spin = 0;
    while (RADIO_REG(R_EVENTS_RSSIEND) == 0 && spin++ < 10000U)
    {
    }

