dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/libraries/Thread/src/ot_radio_nrf52840.cpp
    return lastRssiDbm();
}

otError otPlatRadioEnergyScan(otInstance *aInstance, uint8_t aScanChannel, uint16_t aScanDuration)
{
    (void)aInstance;
    (void)aScanChannel;
    (void)aScanDuration;
    // The sub-MAC performs energy scan in software by polling GetRssi().
    return OT_ERROR_NOT_IMPLEMENTED;
}

void otPlatRadioEnableSrcMatch(otInstance *aInstance, bool aEnable)
{
    (void)aInstance;
    sSrcMatchEnabled = aEnable;
}

otError otPlatRadioAddSrcMatchShortEntry(otInstance *aInstance, otShortAddress aShortAddress)
{
    (void)aInstance;
    uint32_t m = criticalEnter();
    otError  err = OT_ERROR_NO_BUFS;

    for (uint8_t i = 0; i < sSrcMatchShortCount; i++)
    {
        if (sSrcMatchShort[i] == aShortAddress)
        {
            err = OT_ERROR_NONE;
            break;
        }
    }
    if (err != OT_ERROR_NONE && sSrcMatchShortCount < SRC_MATCH_SHORT_COUNT)
    {
        sSrcMatchShort[sSrcMatchShortCount++] = aShortAddress;
        err = OT_ERROR_NONE;
    }

    criticalExit(m);
    return err;
}

otError otPlatRadioAddSrcMatchExtEntry(otInstance *aInstance, const otExtAddress *aExtAddress)
{
    (void)aInstance;
    uint32_t m = criticalEnter();
    otError  err = OT_ERROR_NO_BUFS;

    for (uint8_t i = 0; i < sSrcMatchExtCount; i++)
    {
        if (memcmp(sSrcMatchExt[i], aExtAddress->m8, 8) == 0)
        {
            err = OT_ERROR_NONE;
            break;
        }
    }
    if (err != OT_ERROR_NONE && sSrcMatchExtCount < SRC_MATCH_EXT_COUNT)
    {
        memcpy(sSrcMatchExt[sSrcMatchExtCount++], aExtAddress->m8, 8);
        err = OT_ERROR_NONE;
    }

    criticalExit(m);
    return err;
}

otError otPlatRadioClearSrcMatchShortEntry(otInstance *aInstance, otShortAddress aShortAddress)
{
    (void)aInstance;
    uint32_t m = criticalEnter();
    otError  err = OT_ERROR_NO_ADDRESS;

    for (uint8_t i = 0; i < sSrcMatchShortCount; i++)
    {
        if (sSrcMatchShort[i] == aShortAddress)
        {
            sSrcMatchShort[i] = sSrcMatchShort[--sSrcMatchShortCount];
            err = OT_ERROR_NONE;
            break;
        }
    }

    criticalExit(m);
    return err;
}

otError otPlatRadioClearSrcMatchExtEntry(otInstance *aInstance, const otExtAddress *aExtAddress)
{
    (void)aInstance;
    uint32_t m = criticalEnter();
    otError  err = OT_ERROR_NO_ADDRESS;

    for (uint8_t i = 0; i < sSrcMatchExtCount; i++)
    {
        if (memcmp(sSrcMatchExt[i], aExtAddress->m8, 8) == 0)
        {
            memcpy(sSrcMatchExt[i], sSrcMatchExt[--sSrcMatchExtCount], 8);
            err = OT_ERROR_NONE;
            break;
        }
    }

    criticalExit(m);
    return err;
}

void otPlatRadioClearSrcMatchShortEntries(otInstance *aInstance)
{
    (void)aInstance;
    sSrcMatchShortCount = 0;
}

void otPlatRadioClearSrcMatchExtEntries(otInstance *aInstance)
{
    (void)aInstance;
    sSrcMatchExtCount = 0;
}

// CSL is disabled in the build config; these exist because weak helpers in
// the core (e.g. otPlatRadioResetCsl) still reference them.
otError otPlatRadioEnableCsl(otInstance *aInstance, uint32_t aCslPeriod, otShortAddress aShortAddr, const otExtAddress *aExtAddr)
{
    (void)aInstance;
    (void)aCslPeriod;
    (void)aShortAddr;
    (void)aExtAddr;
    return OT_ERROR_NOT_IMPLEMENTED;
}

void otPlatRadioUpdateCslSampleTime(otInstance *aInstance, uint32_t aCslSampleTime)
{
    (void)aInstance;
    (void)aCslSampleTime;
}

} // extern "C"

// ---------------------------------------------------------------------------
// Init + event pump
// ---------------------------------------------------------------------------

extern "C" void nrfOtRadioInit(void)
{
    // HFXO must be running for the radio to meet RF timing.
    if (CLOCK_REG(C_EVENTS_HFCLKSTARTED) == 0)
    {
        CLOCK_REG(C_TASKS_HFCLKSTART) = 1;
        while (CLOCK_REG(C_EVENTS_HFCLKSTARTED) == 0)
        {
        }
    }

    // The hardware-verified IEEE 802.15.4 configuration.
    RADIO_REG(R_MODE)    = 15;          // Ieee802154_250Kbit
    RADIO_REG(R_PCNF0)   = 0x06000008;  // LFLEN=8, PLEN=32bitZero, CRCINC
    RADIO_REG(R_PCNF1)   = 0x7F;        // MAXLEN=127
    RADIO_REG(R_CRCCNF)  = 0x202;       // 2-byte FCS, skip address
    RADIO_REG(R_CRCPOLY) = 0x011021;
    RADIO_REG(R_CRCINIT) = 0;
    RADIO_REG(R_SFD)     = 0xA7;
    radioApplyChannel();
    radioApplyTxPower();
    otPlatRadioSetCcaEnergyDetectThreshold(NULL, sCcaThresholdDbm);

    for (uint8_t i = 0; i < RX_SLOT_COUNT; i++)
    {
        sRxSlots[i].state = kSlotFree;
    }

    sTxFrame.mPsdu = sTxPsdu;
    sAckRxFrame.mPsdu = &sAckRxBuf[1];

    // Make sure the microsecond clock used for timestamps is running.
    if (!nrfTimer3().isRunning())
    {
        nrfTimer3().begin(1000000U);
        nrfTimer3().start();
    }

    RADIO_REG(R_INTENCLR) = 0xFFFFFFFFUL;
    RADIO_REG(R_INTENSET) = INT_END | INT_CRCERROR | INT_CCAIDLE | INT_CCABUSY;

    NVIC_IPR1_B1 = 0x40;       // priority 2 (0 = highest)
    NVIC_ICER    = RADIO_IRQ_BIT;
    NVIC_ISER    = RADIO_IRQ_BIT;
}

extern "C" void nrfOtRadioProcess(otInstance *aInstance)
{
    // Receive-done events.
    for (uint8_t i = 0; i < RX_SLOT_COUNT; i++)
    {
        RxSlot &slot = sRxSlots[i];

        if (slot.state != kSlotReady)
        {
            continue;
        }

        otRadioFrame frame;

        memset(&frame, 0, sizeof(frame));
        frame.mPsdu    = &slot.buf[1];
        frame.mLength  = slot.buf[0];
        frame.mChannel = sChannel;
        frame.mInfo.mRxInfo.mRssi = slot.rssi;
        frame.mInfo.mRxInfo.mLqi  = slot.lqi;
        frame.mInfo.mRxInfo.mTimestamp = slot.timestamp;
        frame.mInfo.mRxInfo.mAckedWithFramePending = slot.ackedWithFp;

        otPlatRadioReceiveDone(aInstance, &frame, OT_ERROR_NONE);

        slot.state = kSlotFree;
    }

    // Transmit-done events.
    if (sTxPending)
    {
        TxEvent ev = sTxEvent;

        switch (ev)
        {
        case kTxEventDone:
            sTxEvent   = kTxEventNone;
            sTxPending = false;
            otPlatRadioTxDone(aInstance, &sTxFrame, NULL, OT_ERROR_NONE);
            break;

        case kTxEventAcked:
            sTxEvent   = kTxEventNone;
            sTxPending = false;
            otPlatRadioTxDone(aInstance, &sTxFrame, &sAckRxFrame, OT_ERROR_NONE);
            break;

        case kTxEventCcaBusy:
            sTxEvent   = kTxEventNone;
            sTxPending = false;
            otPlatRadioTxDone(aInstance, &sTxFrame, NULL, OT_ERROR_CHANNEL_ACCESS_FAILURE);
            break;

        default:
            break;
        }
    }
}
